## 연습문제 2-1
#### 1. 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [2]:
import numpy as np
import pandas as pd

In [16]:
s1 = pd.Series([95,88,87,98],index=['국어','영어','수학','사회'])
s2 = pd.Series([87,90,100,98],index=['국어','영어','수학','과학'])

#### 2. 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [17]:
s1 + s2

과학      NaN
국어    182.0
사회      NaN
수학    187.0
영어    178.0
dtype: float64

In [18]:
s1 - s2

과학     NaN
국어     8.0
사회     NaN
수학   -13.0
영어    -2.0
dtype: float64

In [19]:
s1 * s2

과학       NaN
국어    8265.0
사회       NaN
수학    8700.0
영어    7920.0
dtype: float64

In [20]:
s1 / s2

과학         NaN
국어    1.091954
사회         NaN
수학    0.870000
영어    0.977778
dtype: float64

## 연습문제 2
#### 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
#### 1. 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
#### 2. 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [41]:
data = {
    "담당교사" : ['이연희','채희석','김형수','이수민','한정호'],
    "2015년" : [95,88,95,86,87],
    "2016년" : [90,91,86,89,93],
    "2017년" : [93,92,100,100,85],
    "2018년" : [85,89,94,87,90],
    "2019년" : [90,92,85,86,93]
}
columns = ['담당교사','2015년','2016년','2017년','2018년','2019년']
index = ['국어','영어','수학','과학','사회']
df = pd.DataFrame(data, index=index, columns=columns)
df["2017~2018 성적 증가율(%)"] = ((df["2018년"] - df["2017년"]) / df["2017년"] * 100).round(2)
df["2018~2019 성적 증가율(%)"] = ((df["2019년"] - df["2018년"]) / df["2018년"] * 100).round(2)
df

,담당교사,2015년,2016년,2017년,2018년,2019년,2017~2018 성적 증가율(%),2018~2019 성적 증가율(%)
국어,이연희,95,90,93,85,90,-8.60,5.88
영어,채희석,88,91,92,89,92,-3.26,3.37
수학,김형수,95,86,100,94,85,-6.00,-9.57
과학,이수민,86,89,100,87,86,-13.00,-1.15
사회,한정호,87,93,85,90,93,5.88,3.33

## 연습문제 3
#### 다음 데이터프레임에서 지정하는 데이터를 뽑아내거라 처리하라.

In [23]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

1. 모든 학생의 수학 점수를 시리즈로 나타낸다.
2. 든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
5. 춘향의 점수를 데이터프레임으로 나타낸다.
6. 향단의 점수를 시리즈로 나타낸다.

In [24]:
#1. 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [25]:
#2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [26]:
#3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = (df.sum(axis=1) / 3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [27]:
#4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어']['방자'] = 80
df["평균"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)
df

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [28]:
#5. 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [29]:
#6. 향단의 점수를 시리즈로 나타낸다.
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

## 연습문제 1
#### 1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

In [3]:
df = pd.DataFrame(np.arange(0,25).reshape(5,5), index = ['a','b','c','d','e'], columns=['A','B','C','D','E'])
df

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

#### 2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [5]:
df['A']

a     0
b     5
c    10
d    15
e    20
Name: A, dtype: int32

In [6]:
df.A

a     0
b     5
c    10
d    15
e    20
Name: A, dtype: int32

In [8]:
df.loc['a']

A    0
B    1
C    2
D    3
E    4
Name: a, dtype: int32

In [10]:
df["a":"b"]

   A  B  C  D  E
a  0  1  2  3  4
b  5  6  7  8  9

In [11]:
df.at["a", "A"]

0

In [7]:
df[:1]

   A  B  C  D  E
a  0  1  2  3  4

In [9]:
df.iloc[4:]

    A   B   C   D   E
e  20  21  22  23  24

In [15]:
df.iat[4, 4]

24

In [14]:
df.iloc[0:1, 1:3]

   B  C
a  1  2

In [13]:
df[df['A'] > 10]

    A   B   C   D   E
d  15  16  17  18  19
e  20  21  22  23  24

## 연습문제 4.2.5
#### 다음 명령으로 타이타닉호 승객 데이터를 데이터프레임으로 읽어온다. 이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.

In [31]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

#### 타이타닉호 승객 데이터의 데이터 값을 각 열마다 구해본다.

In [32]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 연습문제 4.2.6
#### 타이타닉호 승객중 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [33]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [34]:
titanic.age.value_counts().head()

24.0    30
22.0    27
18.0    26
19.0    25
30.0    25
Name: age, dtype: int64

In [35]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [36]:
titanic.alive.value_counts()

no     549
yes    342
Name: alive, dtype: int64

## 연습문제 4.2.7
#### 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해 '미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다. 각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [37]:
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [38]:
titanic_alive = titanic[titanic.survived == 1]['age']
titanic_dead = titanic[titanic.survived == 0]['age']
alive_ = pd.cut(titanic_alive, bins, labels=labels)
alive_.dropna(inplace = True)
dead_ = pd.cut(titanic_dead, bins, labels=labels)
dead_.dropna(inplace = True)

In [39]:
pd.value_counts(alive_)/sum(pd.value_counts(alive_))

중년      0.298561
장년      0.280576
청년      0.269784
미성년자    0.133094
노년      0.017986
Name: age, dtype: float64

In [40]:
pd.value_counts(dead_)/sum(pd.value_counts(dead_))

청년      0.338863
장년      0.277251
중년      0.267773
미성년자    0.075829
노년      0.040284
Name: age, dtype: float64